#+title: Kafka: the streaming database
#+setupfile:
#+property: header_args :dir ~/tmp/

* Key concepts
  :PROPERTIES:
  :ID:       6a9f8a8f-eac4-443d-b52a-1d079c0cdf0f
  :END:


* Kafka for data integration
  :PROPERTIES:
  :ID:       212cddf5-0852-4dda-a608-ebf090b1feec
  :END:


* Usecases
  :PROPERTIES:
  :ID:       4c2ce5e7-6c5d-44e6-805e-b89b9333033e
  :END:

* Practical lessons
  :PROPERTIES:
  :ID:       6e80905a-0451-4fc8-b14f-4d2dac06e15f
  :END:
** User Kafka console script
   :PROPERTIES:
   :ID:       8c1eb0b9-7190-41b9-b2b5-9b478d6362af
   :END:
   #+name: list_topic
   #+begin_src shell
   kubectl --context=secml-prod-data-nrt -n kafka exec testclient -- /opt/kafka/bin/kafka-topics.sh --zookeeper kafka-cluster-zookeeper:2181 --list
   #+end_src

   #+RESULTS: list_topic
   : gshu-test

   #+name: create_topic
   #+begin_src shell
   kubectl --context=secml-prod-data-nrt -n kafka exec testclient -- /opt/kafka/bin/kafka-topics.sh --zookeeper kafka-cluster-zookeeper:2181 --topic gshu-test --create --partitions 1 --replication-factor 1
   #+end_src

   #+RESULTS: create_topic
   : Created topic gshu-test.


   #+name: read_from_topic
   #+begin_src shell
   kubectl --context=secml-prod-data-nrt -n kafka exec -ti testclient -- /opt/kafka/bin/kafka-console-consumer.sh --bootstrap-server kafka-cluster:9092 --topic uploader --from-beginning
   #+end_src

   #+RESULTS: read_from_topic

   #+name: write_to_topic
   #+begin_src shell
   kubectl --context=secml-prod-data-nrt -n kafka exec -ti testclient -- /opt/kafka/bin/kafka-console-producer.sh --broker-list kafka-cluster:9092 --topic gshu-test
   #+end_src

   #+RESULTS: write_to_topic
   : > one


** Understand `__consumer_offsets` topic
   :PROPERTIES:
   :ID:       41149863-3b0b-41f2-8f84-01165d26ff8e
   :END:

   #+name: get_pod
   #+begin_src
   kubectl
   #+end_src

   #+name: get_brokder_ids
   #+begin_src shell
   kubectl --context=secml-prod-data-nrt exec -it -n kafka kafka-cluster-zookeeper-0 -- /opt/bitnami/zookeeper/bin/zkCli.sh ls /brokers/ids
   #+end_src

   #+RESULTS: get_brokder_ids
   | /opt/bitnami/java/bin/java |                     |                |           |
   | Connecting                 | to                  | localhost:2181 |           |
   | WATCHER::                  |                     |                |           |
   | WatchedEvent               | state:SyncConnected | type:None      | path:null |
   | [0,                        | 1                   | 2              |           |


   #+name: check_consumer_offsets
   #+begin_src shell
   kubectl --context=secml-prod-data-nrt exec -it -n kafka testclient -- /opt/kafka/bin/kafka-topics.sh --bootstrap-server kafka-cluster.kafka:9092 --describe --topic __consumer_offsets
   #+end_src

   #+RESULTS: check_consumer_offsets
   | Topic: __consumer_offsets | PartitionCount: 50        | ReplicationFactor: 6 | Configs: compression.type=producer,cleanup.policy=compact,flush.ms=1000,segment.bytes=104857600,flush.messages=10000,max.message.bytes=1000012,retention.bytes=1073741824 |                                         |           |
   |                           | Topic: __consumer_offsets | Partition: 0         | Leader: none                                                                                                                                                              | Replicas: 1038,1039,1037,1023,1024,1022 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 1         | Leader: none                                                                                                                                                              | Replicas: 1039,1037,1038,1024,1022,1023 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 2         | Leader: none                                                                                                                                                              | Replicas: 1037,1038,1039,1022,1023,1024 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 3         | Leader: none                                                                                                                                                              | Replicas: 1038,1037,1039,1023,1022,1024 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 4         | Leader: none                                                                                                                                                              | Replicas: 1039,1038,1037,1024,1023,1022 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 5         | Leader: none                                                                                                                                                              | Replicas: 1037,1039,1038,1022,1024,1023 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 6         | Leader: none                                                                                                                                                              | Replicas: 1038,1039,1037,1023,1024,1022 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 7         | Leader: none                                                                                                                                                              | Replicas: 1039,1037,1038,1024,1022,1023 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 8         | Leader: none                                                                                                                                                              | Replicas: 1037,1038,1039,1022,1023,1024 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 9         | Leader: none                                                                                                                                                              | Replicas: 1038,1037,1039,1023,1022,1024 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 10        | Leader: none                                                                                                                                                              | Replicas: 1039,1038,1037,1024,1023,1022 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 11        | Leader: none                                                                                                                                                              | Replicas: 1037,1039,1038,1022,1024,1023 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 12        | Leader: none                                                                                                                                                              | Replicas: 1038,1039,1037,1023,1024,1022 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 13        | Leader: none                                                                                                                                                              | Replicas: 1039,1037,1038,1024,1022,1023 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 14        | Leader: none                                                                                                                                                              | Replicas: 1037,1038,1039,1022,1023,1024 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 15        | Leader: none                                                                                                                                                              | Replicas: 1038,1037,1039,1023,1022,1024 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 16        | Leader: none                                                                                                                                                              | Replicas: 1039,1038,1037,1024,1023,1022 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 17        | Leader: none                                                                                                                                                              | Replicas: 1037,1039,1038,1022,1024,1023 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 18        | Leader: none                                                                                                                                                              | Replicas: 1038,1039,1037,1023,1024,1022 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 19        | Leader: none                                                                                                                                                              | Replicas: 1039,1037,1038,1024,1022,1023 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 20        | Leader: none                                                                                                                                                              | Replicas: 1037,1038,1039,1022,1023,1024 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 21        | Leader: none                                                                                                                                                              | Replicas: 1038,1037,1039,1023,1022,1024 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 22        | Leader: none                                                                                                                                                              | Replicas: 1039,1038,1037,1024,1023,1022 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 23        | Leader: none                                                                                                                                                              | Replicas: 1037,1039,1038,1022,1024,1023 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 24        | Leader: none                                                                                                                                                              | Replicas: 1038,1039,1037,1023,1024,1022 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 25        | Leader: none                                                                                                                                                              | Replicas: 1039,1037,1038,1024,1022,1023 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 26        | Leader: none                                                                                                                                                              | Replicas: 1037,1038,1039,1022,1023,1024 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 27        | Leader: none                                                                                                                                                              | Replicas: 1038,1037,1039,1023,1022,1024 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 28        | Leader: none                                                                                                                                                              | Replicas: 1039,1038,1037,1024,1023,1022 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 29        | Leader: none                                                                                                                                                              | Replicas: 1037,1039,1038,1022,1024,1023 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 30        | Leader: none                                                                                                                                                              | Replicas: 1038,1039,1037,1023,1024,1022 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 31        | Leader: none                                                                                                                                                              | Replicas: 1039,1037,1038,1024,1022,1023 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 32        | Leader: none                                                                                                                                                              | Replicas: 1037,1038,1039,1022,1023,1024 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 33        | Leader: none                                                                                                                                                              | Replicas: 1038,1037,1039,1023,1022,1024 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 34        | Leader: none                                                                                                                                                              | Replicas: 1039,1038,1037,1024,1023,1022 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 35        | Leader: none                                                                                                                                                              | Replicas: 1037,1039,1038,1022,1024,1023 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 36        | Leader: none                                                                                                                                                              | Replicas: 1038,1039,1037,1023,1024,1022 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 37        | Leader: none                                                                                                                                                              | Replicas: 1039,1037,1038,1024,1022,1023 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 38        | Leader: none                                                                                                                                                              | Replicas: 1037,1038,1039,1022,1023,1024 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 39        | Leader: none                                                                                                                                                              | Replicas: 1038,1037,1039,1023,1022,1024 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 40        | Leader: none                                                                                                                                                              | Replicas: 1039,1038,1037,1024,1023,1022 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 41        | Leader: none                                                                                                                                                              | Replicas: 1037,1039,1038,1022,1024,1023 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 42        | Leader: none                                                                                                                                                              | Replicas: 1038,1039,1037,1023,1024,1022 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 43        | Leader: none                                                                                                                                                              | Replicas: 1039,1037,1038,1024,1022,1023 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 44        | Leader: none                                                                                                                                                              | Replicas: 1037,1038,1039,1022,1023,1024 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 45        | Leader: none                                                                                                                                                              | Replicas: 1038,1037,1039,1023,1022,1024 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 46        | Leader: none                                                                                                                                                              | Replicas: 1039,1038,1037,1024,1023,1022 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 47        | Leader: none                                                                                                                                                              | Replicas: 1037,1039,1038,1022,1024,1023 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 48        | Leader: none                                                                                                                                                              | Replicas: 1038,1039,1037,1023,1024,1022 | Isr: 1023 |
   |                           | Topic: __consumer_offsets | Partition: 49        | Leader: none                                                                                                                                                              | Replicas: 1039,1037,1038,1024,1022,1023 | Isr: 1023 |
